app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT `topics`.* FROM `topics`

  def create
    @topic =Topic.new(params[:topic].permit(:title))
    @topic.save
---
INSERT INTO `topics` (`title`, `created_at`, `updated_at`) VALUES ('オシャレに目覚めたきっかけ', '2020-11-08 19:55:01.129414', '2020-11-08 19:55:01.129414')

  def delete
    @topic = Topic.find(params[:id])
    @topic.destroy
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 3 LIMIT 1
DELETE FROM `topics` WHERE `topics`.`id` = 3

  def show
    @topic = Topic.find(params[:id])
    @newpost = Post.new(:topic_id => params[:id])
    @posts = Post.where(topic_id: params[:id])
---
SELECT `topics`.* FROM `topics` WHERE `topics`.`id` = 1 LIMIT 1
SELECT `posts`.* FROM `posts` WHERE `posts`.`topic_id` = 1